Automatizaciones con Java Framework/Proyectos JAVA Automatización ScreenPlay/src/test/resources/data/Servicios/afiliarOperadorBPI.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://interbank.com.pe/srv/generic/messageFormat/v4.0/" xmlns:v1="http://interbank.com.pe/service/MPO/Utilitarios/bancaSMS.afiliar/v1.0/">
   <soapenv:Header>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-4B79246C37D90EEF6D14988520003296">
            <wsse:Username>uBseVpdAAdm</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">4bs3vpd44dm+</wsse:Password>
            <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">bLKXJo5BciFfREajVarEWA==</wsse:Nonce>
            <wsu:Created>2017-10-04T15:33:40.329Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <v4:HeaderRequest>
         <request>
            <serviceId>BSE</serviceId>
            <consumerId>CTO</consumerId>
            <moduleId>modcontacto</moduleId>
            <channelCode>04</channelCode>
            <messageId>20160623152105100</messageId>
            <timestamp>2016-05-24T11:57:48</timestamp>
            <countryCode>PE</countryCode>
            <groupMember>G0001</groupMember>
            <referenceNumber>REF06002</referenceNumber>
         </request>
         <identity>
            <netId>PU</netId>
            <userId>S23052</userId>
            <supervisorId>S2058</supervisorId>
            <deviceId>130.30.20.80</deviceId>
            <serverId>server12</serverId>
            <branchCode>7</branchCode>
         </identity>
      </v4:HeaderRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v1:Afiliar>
         <listSolAfiliacion>
            <solAfiliacion>
               <datoAfiliacion>
               </datoAfiliacion>
            </solAfiliacion>
         </listSolAfiliacion>
      </v1:Afiliar>
   </soapenv:Body>
</soapenv:Envelope>